<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Узнать свой IP</title>
    <link rel="stylesheet" href="style.css">
    <meta name="description" content="Узнать свой IP, проверить под каким айпи сейчас обозначается на сайтах.">
    <link rel="icon" href="../img/js.svg" type="image/svg+xml">
    <script type="application/ld+json">
        {
        "@context" : "http://schema.org",
        "@type" : "Article",
        "name" : "find out your ip",
        "headline": "Узнать свой IP",
        "author" : {
            "@type" : "Person",
            "name" : "Amir Navrutdinov",
            "url": "https://qucu.ru/resume/Amir.html"
        },
        "datePublished" : "2025-06-14T18:07:27+07:00",
        "dateModified":"2025-06-14T18:07:37+07:00",
        "image" : "https://qucu.ru/Find-out-your-IP/ipadres.webp",
        "articleSection" : "enternet",
        "articleBody" : "IP (Internet Protocol) — это уникальный числовой идентификатор, который присваивается каждому устройству, подключённому к сети Интернет.",
        "url" : "https://qucu.ru/Find-out-your-IP/",
        "publisher" : {
            "@type" : "Organization",
            "name" : "find out your ip",
            "logo": {
                "@type": "ImageObject",
                "url": "https://qucu.ru/img/js.svg"
            }
        }
        }
</script>
</head>
<body>
    <main>
        <article>
            <h1>Узнать свой IP</h1>
            <picture>
                <img src="ipadres.webp" alt="find out your ip">
            </picture>
            <fieldset>
                <legend>Ваш IP: </legend>
                <span><?php echo $_SERVER['REMOTE_ADDR']; ?></span>
            </fieldset>
            <h2>Всё, что вам нужно знать об IP-адресе</h2>
            <p>В современном мире, где технологии играют важную роль в нашей повседневной жизни, понимание основ работы сети становится всё более актуальным. Один из ключевых аспектов, который необходимо знать каждому пользователю интернета, — это IP-адрес. В этой статье мы рассмотрим, что такое IP-адрес, зачем он нужен и как его можно использовать.</p>
            <h3>Что такое IP-адрес?</h3>
            <p>IP (Internet Protocol) — это уникальный числовой идентификатор, который присваивается каждому устройству, подключённому к сети Интернет. Он позволяет устройствам обмениваться данными и взаимодействовать друг с другом. IP-адрес состоит из четырёх чисел, разделённых точками, например, 192.168.0.1.</p>
            <ul>
                <strong>Существует два основных типа IP-адресов:</strong>
                <li>Внутренний (локальный) IP-адрес используется внутри локальной сети и не виден в Интернете. Он обычно начинается с 192.168., 172.16. или 10. и используется для идентификации устройств в пределах одной сети.</li>
                <li>Внешний (публичный) IP-адрес присваивается вашему устройству интернет-провайдером и используется для связи с другими устройствами в Интернете.</li>
            </ul>
            <h4>Зачем нужен IP-адрес?</h4>
            <ol>
                <strong>IP-адрес выполняет несколько важных функций:</strong>
                <li>Идентификация устройства: каждый устройство, подключённое к сети, имеет уникальный IP-адрес, который позволяет другим устройствам определить его и установить соединение.</li>
                <li>Передача данных: IP-адрес используется для маршрутизации данных между устройствами в сети. Когда вы отправляете запрос на веб-сайт или скачиваете файл, ваш IP-адрес помогает определить путь, по которому данные должны быть переданы.</li>
                <li>Обеспечение безопасности: IP-адреса могут использоваться для настройки правил брандмауэра и других мер безопасности, чтобы ограничить доступ к определённым ресурсам или предотвратить несанкционированный доступ.</li>
            </ol>
            <h5>Как узнать свой IP-адрес?</h5>
            <ul>
                <strong>Существует несколько способов узнать свой IP-адрес:</strong>
                <li>Вы можете воспользоваться онлайн-сервисами, которые предоставляют информацию о вашем IP-адресе. Например, на сайте <a href="https://qucu.ru/Find-out-your-IP/ ">https://qucu.ru/Find-out-your-IP/ </a> вы можете получить информацию о своём внешнем IP-адресе.</li>
                <li>В настройках вашего устройства (компьютера, смартфона и т. д.) можно найти информацию о внутреннем IP-адресе, который используется в локальной сети.</li>
            </ul>
            <h6>Заключение</h6>
            <p>IP-адрес — это важный элемент работы сети, который позволяет устройствам взаимодействовать друг с другом и обмениваться данными. Понимание основ работы с IP-адресами поможет вам лучше понять, как работает Интернет, и обеспечить более безопасное и эффективное использование сети.</p>
            <picture>
                <!-- <source srcset=""> -->
                <img src="theEnd.webp" alt="The End">
            </picture>
        </article>
    </main>
</body>
</html>